tap "felixkratz/formulae"
tap "grishka/grishka"
tap "holek/rcon"
tap "homebrew-zathura/zathura"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "koekeishiya/formulae"
tap "libsql/sqld"
tap "microsoft/mssql-release"
tap "nikitabobko/tap"
tap "omnisharp/omnisharp-roslyn"
tap "prbinu/touch2sudo"
tap "tursodatabase/tap"
brew "xz"
brew "openssl@3"
brew "aria2"
brew "arm-none-eabi-gcc"
brew "arm-none-eabi-gdb"
brew "arping"
brew "bat"
brew "bc"
brew "bear"
brew "boost"
brew "btop"
brew "glib"
brew "cairo"
brew "clang-format"
brew "cmake"
brew "ripgrep"
brew "codex"
brew "croc"
brew "dooit"
brew "enet"
brew "eza"
brew "fd"
brew "pango"
brew "ffmpeg"
brew "fzf"
brew "gdk-pixbuf"
brew "glow"
brew "gobuster"
brew "gsl"
brew "pkgconf"
brew "hdf5"
brew "imagemagick"
brew "node"
brew "insect"
brew "jq"
brew "knock"
brew "lazygit"
brew "ldns"
brew "libffi"
brew "libfido2"
brew "libpq", link: true
brew "librsvg"
brew "libsvg"
brew "llvm"
brew "lua"
brew "luajit"
brew "luarocks"
brew "m-cli"
brew "mkcert"
brew "mosh"
brew "nasm"
brew "ncftp"
brew "utf8proc", args: ["HEAD"]
brew "neovim"
brew "net-snmp"
brew "newsboat"
brew "ninja"
brew "nmap"
brew "noti"
brew "nss"
brew "opencode"
brew "openssh"
brew "pandoc"
brew "pdm"
brew "poppler"
brew "pyenv"
brew "pylint"
brew "python-tk@3.9"
brew "python@3.11"
brew "python@3.12"
brew "raylib"
brew "roadrunner"
brew "rsync"
brew "sesh"
brew "sevenzip"
brew "spotify_player"
brew "tcl-tk"
brew "telnet"
brew "tlrc"
brew "tmux"
brew "tokei"
brew "tre-command"
brew "tree"
brew "vim"
brew "w3m"
brew "websocat"
brew "wget"
brew "wireguard-go"
brew "wireguard-tools"
brew "wrk"
brew "wstunnel"
brew "xxh"
brew "yazi"
brew "yt-dlp"
brew "zlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"
brew "felixkratz/formulae/svim"
brew "holek/rcon/rcon"
brew "hudochenkov/sshpass/sshpass"
brew "microsoft/mssql-release/mssql-tools"
brew "tursodatabase/tap/turso"
cask "aerospace"
cask "android-platform-tools"
cask "claude-code"
cask "docker-desktop"
cask "dotnet-runtime"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "gstreamer-runtime"
cask "libreoffice"
cask "love"
cask "pennywise"
cask "wine-stable"
vscode "aaron-bond.better-comments"
vscode "abusaidm.html-snippets"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "anteprimorac.html-end-tag-labels"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "cfgweb.vscode-perl"
vscode "codezombiech.gitignore"
vscode "ctcuff.font-preview"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "dzhavat.css-flexbox-cheatsheet"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eg2.vscode-npm-script"
vscode "equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "igorpnev.css-flexbox-snippet"
vscode "imzivko.cursor-dark-core"
vscode "inci-august.august-themes"
vscode "jeff-hykin.better-cpp-syntax"
vscode "marlosirapuan.nord-deep"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "msyrus.go-doc"
vscode "naumovs.color-highlight"
vscode "nico-castell.linux-desktop-file"
vscode "nord.nord"
vscode "oderwat.indent-rainbow"
vscode "ohansemmanuel.css-grid-snippets"
vscode "openai.chatgpt"
vscode "patbenatar.advanced-new-file"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "pranaygp.vscode-css-peek"
vscode "richterger.perl"
vscode "ritwickdey.liveserver"
vscode "rogalmic.bash-debug"
vscode "sachinb94.css-tree"
vscode "shakram02.bash-beautify"
vscode "softwaredotcom.swdc-vscode"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "yy0931.save-as-root"
vscode "zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"
go "github.com/bootdotdev/bootdev"
cargo "simple-completion-language-server"
